xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_usart.h
/** @defgroup USART_Parity    USART Parity
  * @{
  */
#define USART_PARITY_NONE                   0x00000000U                      /*!< No parity   */
#define USART_PARITY_EVEN                   USART_CR1_PCE                    /*!< Even parity */
#define USART_PARITY_ODD                    (USART_CR1_PCE | USART_CR1_PS)   /*!< Odd parity  */
/**
  * @}
  */

/** @defgroup USART_Mode   USART Mode
  * @{
  */
#define USART_MODE_RX                       USART_CR1_RE                    /*!< RX mode        */
#define USART_MODE_TX                       USART_CR1_TE                    /*!< TX mode        */
#define USART_MODE_TX_RX                    (USART_CR1_TE |USART_CR1_RE)    /*!< RX and TX mode */
/**
  * @}
  */

/** @defgroup USART_Clock  USART Clock
  * @{
  */
#define USART_CLOCK_DISABLE                 0x00000000U       /*!< USART clock disable */
#define USART_CLOCK_ENABLE                  USART_CR2_CLKEN   /*!< USART clock enable  */
/**
  * @}
  */

/** @defgroup USART_Clock_Polarity  USART Clock Polarity
  * @{
  */
#define USART_POLARITY_LOW                  0x00000000U      /*!< Driver enable signal is active high */
#define USART_POLARITY_HIGH                 USART_CR2_CPOL   /*!< Driver enable signal is active low  */
/**
  * @}
  */

/** @defgroup USART_Clock_Phase   USART Clock Phase
  * @{
  */
#define USART_PHASE_1EDGE                   0x00000000U      /*!< USART frame phase on first clock transition  */
#define USART_PHASE_2EDGE                   USART_CR2_CPHA   /*!< USART frame phase on second clock transition */
/**
  * @}
  */

/** @defgroup USART_Last_Bit  USART Last Bit
  * @{
  */
#define USART_LASTBIT_DISABLE               0x00000000U      /*!< USART frame last data bit clock pulse not output to SCLK pin */
#define USART_LASTBIT_ENABLE                USART_CR2_LBCL   /*!< USART frame last data bit clock pulse output to SCLK pin     */
/**
  * @}
  */

/** @defgroup USART_Over_Sampling USART Over Sampling
  * @{
  */
#define USART_OVERSAMPLING_16               0x00000000U
#if defined(USART_CR3_OVER8)
#define USART_OVERSAMPLING_8                ((uint32_t)USART_CR3_OVER8)
#endif /* USART_CR3_OVER8 */
/**
  * @}
  */

/** @defgroup USART_Flags      USART Flags
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the ISR register
  * @{
  */
#if defined(USART_SR_TXLSEF)
#define USART_FLAG_TXLSEF                   USART_SR_TXLSEF        /*!< USART TX shift register Empty flag         */
#endif
#define USART_FLAG_WAITRPT                  USART_SR_WAIT_RPT      /*!< USART Waiting retransmit data flag         */
#define USART_FLAG_TXBUSY                   USART_SR_TXBUSY        /*!< USART TX busy flag                         */
#define USART_FLAG_RXBUSY                   USART_SR_RXBUSY        /*!< USART RX busy flag                         */
#define USART_FLAG_TXPE                     USART_SR_TXPE          /*!< USART TX data parity error flag            */
#define USART_FLAG_RTOF                     USART_SR_RTOF          /*!< USART receiver timeout flag                */
#define USART_FLAG_EOBF                     USART_SR_EOBF          /*!< USART block end flag                       */
#define USART_FLAG_ABRRQ                    USART_SR_ABRRQ         /*!< USART auto BRR request flag                */
#define USART_FLAG_ABRE                     USART_SR_ABRE          /*!< USART auto BRR error flag                  */
#define USART_FLAG_ABRF                     USART_SR_ABRF          /*!< USART auto BRR detection flag              */
#define USART_FLAG_CTS                      USART_SR_CTS           /*!< USART CTS flag                             */
#define USART_FLAG_LBD                      USART_SR_LBD           /*!< USART LIN break detection flag             */
#define USART_FLAG_TXE                      USART_SR_TXE           /*!< USART transmit data register empty         */
#define USART_FLAG_TC                       USART_SR_TC            /*!< USART transmission complete                */
#define USART_FLAG_RXNE                     USART_SR_RXNE          /*!< USART read data register not empty         */
#define USART_FLAG_IDLE                     USART_SR_IDLE          /*!< USART idle flag                            */
#define USART_FLAG_ORE                      USART_SR_ORE           /*!< USART overrun error                        */
#define USART_FLAG_NE                       USART_SR_NE            /*!< USART noise error                          */
#define USART_FLAG_FE                       USART_SR_FE            /*!< USART frame error                          */
#define USART_FLAG_PE                       USART_SR_PE            /*!< USART parity error                         */
/**
  * @}
  */
/** @defgroup USART_Private_Constants USART Private Constants
  * @{
  */
/** @brief USART interruptions flag mask
  *
  */
#define USART_IT_MASK                     0x0000001FU

#define USART_CR1_REG_INDEX               1U
#define USART_CR2_REG_INDEX               2U
#define USART_CR3_REG_INDEX               3U
/**
  * @}
  */
/** @defgroup USART_Interrupt_definition USART Interrupts Definition
  *        Elements values convention: 000ZZZZZ0XXYYYYYb
  *           - YYYYY  : Interrupt source position in the XX register (5bits)
  *           - XX  : Interrupt source register (2bits)
  *                 - 01: CR1 register
  *                 - 10: CR2 register
  *                 - 11: CR3 register
  *           - ZZZZZ  : Flag position in the ISR register(5bits)
  *        Elements values convention: 000000000XXYYYYYb
  *           - YYYYY  : Interrupt source position in the XX register (5bits)
  *           - XX  : Interrupt source register (2bits)
  *                 - 01: CR1 register
  *                 - 10: CR2 register
  *                 - 11: CR3 register
  *        Elements values convention: 0000ZZZZ00000000b
  *           - ZZZZ  : Flag position in the ISR register(4bits)
  * @{
  */

#define USART_IT_PE                          0x0028U  /*!< USART parity error interruption                 */
#define USART_IT_TXE                         0x0727U  /*!< USART transmit data register empty interruption */
#define USART_IT_TC                          0x0626U  /*!< USART transmission complete interruption        */
#define USART_IT_RXNE                        0x0525U  /*!< USART read data register not empty interruption */
#define USART_IT_IDLE                        0x0424U  /*!< USART idle interruption                         */
#define USART_IT_LBD                         0x0846U  /*!< USART LBD interruption                          */
#define USART_IT_TXLSE                       0x127FU  /*!< USART TXLSE interruption                        */
#define USART_IT_EOB                         0x127EU  /*!< USART EOB interruption                          */
#define USART_IT_RTO                         0x137DU  /*!< USART RTO interruption                          */
#define USART_IT_CTS                         0x096AU  /*!< USART CTS interruption                          */

#define USART_IT_ERR                         0x0060U  /*!< USART error interruption                        */
#define USART_IT_ORE                         0x0300U  /*!< USART overrun error interruption                */
#define USART_IT_NE                          0x0200U  /*!< USART noise error interruption                  */
#define USART_IT_FE                          0x0100U  /*!< USART frame error interruption                  */

/**
  * @}
  */

/**
  * @}
  */
 
/* Exported macros -----------------------------------------------------------*/
/** @defgroup USART_Exported_Macros USART Exported Macros
  * @{
  */

/** @brief Reset USART handle state.
  * @param  __HANDLE__ USART handle.
  * @retval None
  */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
#define __HAL_USART_RESET_HANDLE_STATE(__HANDLE__)  do{                                            \
                                                        (__HANDLE__)->State = HAL_USART_STATE_RESET; \
                                                        (__HANDLE__)->MspInitCallback = NULL;        \
                                                        (__HANDLE__)->MspDeInitCallback = NULL;      \
                                                      } while(0U)
#else
#define __HAL_USART_RESET_HANDLE_STATE(__HANDLE__)  ((__HANDLE__)->State = HAL_USART_STATE_RESET)
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */

/** @brief  Flushes the USART DR register
  * @param  __HANDLE__ specifies the USART Handle.
  *         USART Handle selects the USARTx or USARTy peripheral
  *         (USART,USART availability and x,y values depending on device).
  */
#define __HAL_USART_FLUSH_DRREGISTER(__HANDLE__) ((__HANDLE__)->Instance->DR)

/** @brief  Clears the specified USART pending flag.
  * @param  __HANDLE__ specifies the USART Handle.
  *         USART Handle selects the USARTx or USARTy peripheral
  *         (USART,USART availability and x,y values depending on device).
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg USART_FLAG_TXPE TX data parity error flag.
  *            @arg USART_FLAG_RTOF Receiver timeout flag.
  *            @arg USART_FLAG_EOBF Block end flag.
  *            @arg USART_FLAG_CTS  CTS Change flag.
  *            @arg USART_FLAG_LBD  LIN Break detection flag.
  *            @arg USART_FLAG_TC   Transmission Complete flag.
  *            @arg USART_FLAG_RXNE Receive data register not empty flag.
  *
  * @note   PE (Parity error), FE (Framing error), NE (Noise error), ORE (Overrun
  *          error) and IDLE (Idle line detected) flags are cleared by software
  *          sequence: a read operation to USART_SR register followed by a read
  *          operation to USART_DR register.
  * @note   RXNE flag can be also cleared by a read to the USART_DR register.
  * @note   TC flag can be also cleared by software sequence: a read operation to
  *          USART_SR register followed by a write operation to USART_DR register.
  * @note   TXE flag is cleared only by a write to the USART_DR register.
  *
  * @retval None
  */
#define __HAL_USART_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->SR = ~(__FLAG__))

